In [ ]:
import sys
print(sys.executable)

### Import libs

In [11]:
import pandas as pd

In [8]:
df = pd.read_csv('https://raw.githubusercontent.com/jorisvandenbossche/pandas-tutorial/master/data/titanic.csv')

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [15]:
df2 = pd.DataFrame.from_dict({'a': [1,2]})

In [17]:
df2

   a
0  1
1  2

### write to csv

In [20]:
df.to_csv('./tmp.csv')

### info and analysis of data

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### size of the datasest

In [ ]:
df.shape

### describe() shows a quick statistic summary of your data:

In [29]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### return columns

In [23]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [27]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [26]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### dtypes return all columns data types

In [28]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Getitem ([])

For a DataFrame, passing a single label selects a columns and yields a **Series** equivalent to df.A:

In [30]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

### **Series** is a data structure that is used to store 1D array (odnomerniy massiv)

In [33]:
type(df['Name']) # returns Series obj

pandas.core.series.Series

In [34]:
df['Name'].shape

(891,)

### Sampling by columns
use array inside of array in any order

In [37]:
df[['Sex' ,'Name', 'Age']]

        Sex                                               Name   Age
0      male                            Braund, Mr. Owen Harris  22.0
1    female  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2    female                             Heikkinen, Miss. Laina  26.0
3    female       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4      male                           Allen, Mr. William Henry  35.0
..      ...                                                ...   ...
886    male                              Montvila, Rev. Juozas  27.0
887  female                       Graham, Miss. Margaret Edith  19.0
888  female           Johnston, Miss. Catherine Helen "Carrie"   NaN
889    male                              Behr, Mr. Karl Howell  26.0
890    male                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

### Sampling by columns and rows using tail() or head()

In [41]:
df[['Name', 'Age', 'Sex']].head(3)

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female

### Sampling by columns AND rows using **loc() iloc()**

loc workes with column names and with index values. e.g [[index], ['value']]

In [51]:
df.loc[[5, 10, 15], ['Name', 'Age', 'Survived']]

                                Name   Age  Survived
5                   Moran, Mr. James   NaN         0
10   Sandstrom, Miss. Marguerite Rut   4.0         1
15  Hewlett, Mrs. (Mary D Kingcome)   55.0         1

### Sampling by COLUMN ORDER AND INDEX ORDER 

Основное различие между этими двумя методами заключается в том, что iloc применяется для обращения по численному индексу, тогда как loc используется для обращения по метке (label).

в loc можно обращаться по значению, а в iloc только по целочисоенному индексу

In [54]:
df.iloc[[5, 10, 15], [0, 3, 5, 1]]

    PassengerId                              Name   Age  Survived
5             6                  Moran, Mr. James   NaN         0
10           11   Sandstrom, Miss. Marguerite Rut   4.0         1
15           16  Hewlett, Mrs. (Mary D Kingcome)   55.0         1